TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/examples/peripherals/lcd/raster_example.c
//*****************************************************************************
//
// raster_example.c - An example showing the use of the TM4C129x LCD
//                    controller in raster mode.
//
// Copyright (c) 2012-2017 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
// 
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the  
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// 
// This is part of revision 2.1.4.178 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "inc/hw_memmap.h"
#include "inc/hw_gpio.h"
#include "inc/hw_ints.h"
#include "inc/hw_lcd.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/lcd.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "grlib/grlib.h"
#include "utils/uartstdio.h"
#include "utils/ustdlib.h"
#include "drivers/grlib_raster_driver_1bpp.h"
#include "drivers/grlib_raster_driver_4bpp.h"
#include "drivers/grlib_raster_driver_8bpp.h"
#include "drivers/grlib_raster_driver_16bpp.h"
#include "drivers/raster_displays.h"
#include "drivers/sdram.h"

//*****************************************************************************
//
//! \addtogroup lcd_examples_list
//! <h1>LCD Controller Raster Mode Example (raster_example)</h1>
//!
//! This application illustrates the use of the Tivaware Graphics Library
//! and Tiva TM4C129x LCD controller driving an 800x480 display using raster
//! (HSYNC/VSYNC/ACTIVE/DATA) mode.  The display is initialized and enabled
//! then a simple pattern including lines, a small image, some text and a
//! circle is displayed.
//!
//! By default, the application is set up to support an Innolux EJ090NA-03A
//! display with 800x480 resolution, refreshed at 60Hz from a 16bpp frame
//! buffer stored in SDRAM.  The SDRAM is attached to the MCU via the External
//! Peripheral Interface (EPI) module.  The file drivers/raster_displays.c
//! contains timings and initialization functions for several other displays
//! and the application can be easily rebuilt to support any of these by
//! replacing the preprocessor define ``\b INNOLUX_DISPLAY'' with one of the
//! other display labels:
//!
//! - \b OPTREX_DISPLAY supports an Optrex T-55226D043J-LW-A-AAN in 800x480
//! with 75Hz refresh rate.
//! - \b LXD_DISPLAY supports an LXD M7170A in 640x480 with 60Hz refresh rate.
//! - \b FORMIKE_DISPLAY supports at Formike KWH070KQ13 in 800x480 with 60Hz
//! refresh rate.
//!
//! Display interface timing information and any required initialization code
//! is included in the file lcd/drivers/raster_displays.c.  New raster-mode
//! displays can be added to this file and raster_displays.h very easily and
//! used by the application merely by adding another display label and
//! appropriate code to set the tRasterDisplayInfo timing structure for that
//! display at the top of raster_example.c.
//!
//! Once appropriate display timings have been determined, the display can be
//! used by the TivaWare Graphics Library via one of the supplied raster mode
//! display drivers.  Four distinct drivers are supplied in the lcd/drivers
//! directory, each supporting a different color depth for the frame buffer:
//!
//! - \b grlib_raster_driver_1bpp.c supports a monochrome (2 color) display
//! buffer.
//! - \b grlib_raster_driver_4bpp.c supports a 4 bit per pixel (16 color) frame
//! buffer.
//! - \b grlib_raster_driver_8bpp supports an 8 bit per pixel (256 color) frame
//! buffer.
//! - \b grlib_raster_driver_16bpp supports a 16 bit per pixel (65536 color)
//! frame buffer.
//!
//! The size of frame buffer required varies with the resolution of the LCD
//! display in use and the desired frame buffer color depth.  Note that the
//! frame buffer color depth may be lower than the native color resolution of
//! the LCD panel - the LCD controller makes use of a color lookup table or
//! palette to convert the pixels in the frame buffer to the correct color
//! format for the LCD's hardware interface.
//!
//! The size of frame buffer, in bytes, can be determined using the following
//! formula:
//!
//! Buffer Size = X * Y * (BPP / 8) + (Header Size)
//!
//! where:
//!
//! - X is the horizontal pixel resolution of the LCD panel
//! - Y is the vertical pixel resolution of the LCD panel
//! - BPP is the desired number of bits per pixel for the frame buffer
//! - Header Size is 512 for 8bpp frame buffers or 32 for all other color
//! resolutions.
//!
//! The frame buffer header contains information informing the LCD controller
//! of the pixel format in the frame buffer and also the color lookup table
//! used for 1, 4 and 8bpp cases.  Note that a 32 byte header is still required
//! even when using 16bpp frame buffers which do not require a color lookup
//! table.
//!
//! For large panels such as those described in raster_displays.h, a frame
//! buffer supporting more than two colors is likely to be too large to fit
//! in the internal memory of a TM4C129x device and would, therefore, require
//! the use of external, EPI-connected SDRAM.  The 16bpp 800x480 frame buffer
//! used in this application requires almost 940KB of RAM for example. For lower
//! resolution displays or lower color depths, internal SRAM may be suitable
//! for use as the frame buffer.  For example, a 16bpp QVGA (320x240) frame
//! buffer occupies about 150KB of storage and a monochrome (1bpp) 800x480
//! frame buffer needs only 48KB.
//
//*****************************************************************************

//*****************************************************************************
//
// Pointer to EPI SDRAM if available.
//
//*****************************************************************************
uint16_t *g_pui16SDRAM;

//*****************************************************************************
//
// Frame buffer and palette size.
//
//*****************************************************************************
#ifdef OPTREX_DISPLAY
const tRasterDisplayInfo *g_psDisplayMode = &g_sOptrex800x480x75Hz;
#define SCREEN_BPP    16
#else
#ifdef LXD_DISPLAY
const tRasterDisplayInfo *g_psDisplayMode = &g_sLXD640x480x60Hz;
#define SCREEN_BPP    16
#else
#ifdef FORMIKE_DISPLAY
const tRasterDisplayInfo *g_psDisplayMode = &g_sFormike800x480x60Hz;
#define SCREEN_BPP    16
#else
#ifdef INNOLUX_DISPLAY
const tRasterDisplayInfo *g_psDisplayMode = &g_sInnoLux800x480x60Hz;
#define SCREEN_BPP    16
#else
#error Target display type is not defined!
#endif
#endif
#endif
#endif

#define SIZE_BUFFER ((RASTER_WIDTH * RASTER_HEIGHT * SCREEN_BPP) / 8)
#define SIZE_PALETTE ((SCREEN_BPP == 8) ? (256 * 2) : (16 * 2))

//*****************************************************************************
//
// Pointers to the frame buffer into SDRAM.
//
//*****************************************************************************
uint32_t *g_pui32DisplayBuffer;
uint16_t *g_pui16Palette;

#if SCREEN_BPP == 8
#define NUM_PAL_ENTRIES 256
#else
#define NUM_PAL_ENTRIES 16
#endif

const uint32_t g_pulSrcPalette[NUM_PAL_ENTRIES] =
{
    ClrBlack,
    ClrWhite,
    ClrRed,
    0x00FF00,
    ClrBlue,
    ClrYellow,
    ClrMagenta,
    ClrCyan,
    ClrOrange,
    ClrDarkBlue,
    ClrGold,
    ClrOrange,
    ClrCrimson,
    ClrDarkTurquoise,
    ClrDarkGray,
    ClrSilver,
};

//*****************************************************************************
//
// A couple of macros used to extract the dimensions from an image.
//
//*****************************************************************************
#define IMAGE_WIDTH(ptr) ((*(uint16_t *)((uint8_t *)(ptr) + 1)))
#define IMAGE_HEIGHT(ptr) ((*(uint16_t *)((uint8_t *)(ptr) + 3)))

//*****************************************************************************
//
// Graphics context used to show text on the QVGA display.
//
//*****************************************************************************
tContext g_sContext;

//*****************************************************************************
//
// Global interrupt status flags.
//
//*****************************************************************************
static volatile uint32_t g_ui32Flags;
static volatile uint32_t g_ui32FrameCounter;
static volatile uint32_t g_ui32UnderflowCount;

//*****************************************************************************
//
// The image of the TI logo.
//
//*****************************************************************************
const unsigned char g_pucLogo[] =
{
    IMAGE_FMT_4BPP_COMP,
    80, 0,
    75, 0,

